<?php

//=========================================
// T@D@:
// 1) Перенести настройки кук в админку
// 2) Перенести настройки времени тудаже
// 3) Перенести настройки редактора тудаже
//=========================================

// ATTENTION!
// $VARS['asset_url'] MUST BE SET BEFORE INCLUDING THIS SCRIPTS

if( empty( $VARS['asset_url'] )) {
    throw new \Exception('asset url was not set');
}

//-----------------------------------------
// URL сайта
//-----------------------------------------

$VARS['root_url'] = '/';
$VARS['base_url'] = 'index.php';
$VARS['year'] = date('Y');
$VARS['modifdate'] = 'v=1.3';
$VARS['generator'] = 'RAMPAGE CMS';

//-----------------------------------------
// Группы пользователей
//-----------------------------------------

$VARS['admin_group']	=	'4';
$VARS['guest_group']	=	'2';
$VARS['member_group']	=	'3';
$VARS['auth_group']		=	'1'; 
$VARS['party_group']	=	'8'; 

//-----------------------------------------
// Домен и путь для куков и их ID
//-----------------------------------------

$VARS['cookie_domain']	= '';
$VARS['cookie_path']	= '';
$VARS['cookie_id']		= '';

//-----------------------------------------
// Файл для записи логов при отладке
//-----------------------------------------

$VARS['log_file']		= ROOT_PATH . DIRECTORY_SEPARATOR . 'log_file.log';

//-----------------------------------------
// Формат вывода числового времени для gmdate
//-----------------------------------------

$VARS['time_use_relative_format'] = 'h:i A';

//-----------------------------------------
// Форматы вывода времени на все случаи жизни
//-----------------------------------------

$VARS['clock_joined']	= 'j-F y';
$VARS['clock_short']	= 'jS F Y - h:i A';
$VARS['clock_long']		= 'M j Y, h:i A';
$VARS['clock_tiny']		= 'j M Y - G:i';
$VARS['clock_date']		= 'j M Y';

//-----------------------------------------
// Язык по умолчанию. Соответствует директории
// 	'./sources/language/ru/', например.
//-----------------------------------------

$VARS['default_language'] = 'ru';

//-----------------------------------------
// Настройки WYSIWYG RTE
//-----------------------------------------

// Какие типы изображений могут быть загружены

$VARS['rte_img_types'] = 'jpg, jpeg, gif, png, swf, wmv';

// Какие типы документов могут быть загружены

$VARS['rte_doc_types'] = 'html, htm, pdf, doc, rtf, txt, xl, xls, ppt, pps, zip, tar, swf, wmv, rm, mov, jpg, jpeg, gif, png, rar, bz2, mp3, mpeg';

//-----------------------------------------
// Каталог куда будут загружаться документы
//-----------------------------------------

$VARS['docs_dir'] = ROOT_PATH . DIRECTORY_SEPARATOR . 'www/documents/';

//-----------------------------------------
// Максимально допустимый размер загружаемых 
// документов ( в байтах )
//-----------------------------------------
							 
$VARS['max_doc_file_size'] = 20971520; // 20M

//-----------------------------------------
// Максимально допустимый размер загружаемых 
// изображений ( в байтах )
//-----------------------------------------

$VARS['max_img_file_size'] = 20971520; // 20M

//-----------------------------------------
// Каталог куда будут загружаться изображения
// Путь в файловой системе URL соответственно
//-----------------------------------------

$VARS['imgs_dir'] = ROOT_PATH . DIRECTORY_SEPARATOR . 'www/images/';
$VARS['imgs_url'] = $VARS['root_url'] . 'images/';

//-----------------------------------------
// Максимально допустимые размеры для 
// загружаемых изображений ( в пикселах )
//-----------------------------------------

$VARS['max_image_width']  = 5000;
$VARS['max_image_height'] = 5000;

//-----------------------------------------
// URL как каталогу JS-скриптов
// используемых текстовым редактором
//-----------------------------------------

$VARS['css'] = $VARS['asset_url'];
$VARS['img'] = $VARS['asset_url'] . '/images/';
$VARS['js']  = $VARS['asset_url'] . '/scripts/';

//-----------------------------------------
// Идентификаторы корневой папки вртиуальных
// файловых менеджеров. Напрямую связаны 
// с sql-таблицей `vfs_folders`.
// Должны существовать в этой таблице и 
// иметь значение поля `parent` = 0
//-----------------------------------------

$VARS['db_imgs_mgr_root_id'] = 1;
$VARS['db_docs_mgr_root_id'] = 2;
$VARS['db_text_mgr_root_id'] = 3;

//-----------------------------------------
// Альясы которые не могут использоваться на сайте в корневой директории
//-----------------------------------------

$VARS['illegal_aliases'] = array( 'admin', 'documents', 'gallery', 'images', 'assets', 'eng' );

//-----------------------------------------
// Унифицированные имена переменных запроса
//-----------------------------------------

$VARS['env_var'] = 'u';
$VARS['mod_var'] = 'a';
$VARS['act_var'] = 'i';
$VARS['idx_var'] = 'x';
$VARS['tab_var'] = 's';
